app/controllers/hotels_controller.rb

  def index
    hotels = Hotel.all.order(:name)
---
SELECT "hotels".* FROM "hotels" ORDER BY "hotels"."name" ASC

  def create
    hotel = Hotel.new(hotel_params)
    if hotel.save
---
INSERT INTO "hotels" ("name", "location", "rating", "description", "created_at", "updated_at") VALUES ('Apahotel', 'Asakusa-Kaminarimon', 3, 'Asakusa Kaminarimon close to Asakusa station', '2025-11-09 02:38:17.428924', '2025-11-09 02:38:17.428924') RETURNING "id"

  def update
    if @hotel.update(hotel_params)
---
UPDATE "hotels" SET "description" = 'the hotel is cool,', "updated_at" = '2025-11-12 19:54:16.530433' WHERE "hotels"."id" = 3

  def destroy
    @hotel.destroy
---
DELETE FROM "hotels" WHERE "hotels"."id" = 3

  def set_hotel
    @hotel = Hotel.find(params[:id])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = 1 LIMIT 1