app/controllers/rooms_controller.rb

  def create
    room = @hotel.rooms.new(room_params)
    if room.save
---
INSERT INTO "rooms" ("number", "room_type", "price", "hotel_id", "created_at", "updated_at") VALUES ('1', 'Double', 45000.0, 1, '2025-11-09 02:39:08.185535', '2025-11-09 02:39:08.185535') RETURNING "id"

  def update
    if @room.update(room_params)
---
UPDATE "rooms" SET "price" = 300.0, "updated_at" = '2025-11-09 02:39:23.002924' WHERE "rooms"."id" = 1

  def set_hotel
    @hotel = Hotel.find(params[:hotel_id])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = 1 LIMIT 1

  def set_room
    @room = @hotel.rooms.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."hotel_id" = 1 AND "rooms"."id" = 1 LIMIT 1